==================
Atom
==================

-x(
    a
).

-x(
    a@09_Z
).

---

(source_file
  (attribute (atom) (atom))
  (attribute (atom) (atom))
)

==================
Var
==================

-x(
    Z
).

-x(
    _@
).

---

(source_file
  (attribute (atom) (var))
  (attribute (atom) (var))
)

==================
Wildcard
==================

-x(
    _
).

---

(source_file
  (attribute (atom) (wildcard))
)

==================
String
==================

-x(
    "abc\0\00\000\xAA\x{DEADBEEF}\n\r\t\v\b\f\e\s\d\
    "
).

---

(source_file
  (attribute (atom) (string))
)

==================
Quoted atom
==================

-x(
    'abc\0\00\000\xAA\x{DEADBEEF}\n\r\t\v\b\f\e\s\d\
    '
).

---

(source_file
  (attribute (atom) (atom))
)
